swt/time_management.html
---
layout: page
title: Time_management
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Zeitplanung</h2>
<div class="outline-text-2" id="text-1">
<p>
Vorgehen
</p>

<ul class="org-ul">
<li>Aufteilung des Projekts in Einzelaufgaben
</li>
<li>Aufgaben sollen so weit wie möglich nebenläufig organisiert werden
</li>
<li>Festlegen von <i>Milestones</i>: Kennzeichen den Abschluss eines
Teilprojekts, zu dem i.d.R. bestimmte Produkte erwartet werden.
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Pert Charts</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Zeigen Abhängigkeiten zwischen Aktivitäten und <i>kritische Pfade</i>.
Kritische Pfade sind Pfade, auf denen Verzögerungen zu Verzögerungen des
gesamten Projekts führen.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Gantt Charts</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Balkendiagramme zur Abbildung von Aktivitäten auf Kalenderzeiten.
</p>
</div>
</div>
</div>
